---
kind: method
id: M:Autodesk.Revit.DB.ViewScheduleExportOptions.Dispose
source: html/1540e64b-8a7d-faff-899a-e1914bcf0546.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.Dispose Method

Releases all resources used by the ViewScheduleExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```